[  {    "categoria": "Diagnóstico de Sistema e Desempenho",    "mensagem": "Pode utilizar esta funcionalidade para analisar o estado atual do seu sistema, identificar processos que consomem recursos e verificar a integridade dos discos.",    "sugestao": "Execute uma análise completa e aguarde o relatório. Se encontrar alertas, diga-nos e ajudamos a interpretar e corrigir.",    "palavras_chave": [      "desempenho",      "análise",      "lento",      "sistema",      "disco",      "memória",      "processos",      "verificação"    ]  },  {    "categoria": "Limpeza e Optimização de Disco",    "mensagem": "Com a limpeza e optimização, pode libertar espaço no disco, remover ficheiros temporários e acelerar o desempenho geral do PC.",    "sugestao": "Escolha a opção de 'Limpeza automática' ou revise manualmente os itens detetados antes de confirmar a remoção.",    "palavras_chave": [      "limpeza",      "disco",      "cache",      "desempenho",      "acelerar",      "espaço",      "ficheiros temporários"    ]  },  {    "categoria": "Segurança e Verificação de Ameaças",    "mensagem": "A funcionalidade de segurança permite procurar e eliminar software malicioso, aplicações potencialmente perigosas e ficheiros suspeitos.",    "sugestao": "Recomendamos fazer uma verificação completa pelo menos uma vez por semana. Pode também ativar a proteção em tempo real (se disponível).",    "palavras_chave": [      "ameaças",      "malware",      "vírus",      "segurança",      "verificação",      "quarentena",      "análise"    ]  },  {    "categoria": "Recuperação do Sistema / Reinstalação de Linux",    "mensagem": "A ferramenta de recuperação e reinstalação permite restaurar o sistema para um estado anterior ou instalar uma versão limpa de Linux no seu computador.",    "sugestao": "Este processo pode apagar dados. Recomendamos fazer cópia de segurança dos seus ficheiros antes de continuar.",    "palavras_chave": [      "recuperação",      "reinstalação",      "restaurar",      "linux",      "backup",      "sistema",      "formatar"    ]  },  {    "categoria": "Ferramentas para Telemóveis (Ligação, Backup, Limpeza, etc.)",    "mensagem": "O nosso menu de ferramentas para telemóveis oferece opções como backup de dados, limpeza de ficheiros desnecessários e ligação ao PC.",    "sugestao": "Ligue o telemóvel via USB ou Wi-Fi (conforme suportado) e abra o menu 'Telemóvel' no software. Siga os passos indicados.",    "palavras_chave": [      "telemóvel",      "ligação",      "backup",      "limpeza",      "usb",      "wifi",      "dados"    ]  },  {    "categoria": "Outras Questões Técnicas",    "mensagem": "Para o podermos ajudar melhor, envie por favor uma descrição mais detalhada do problema que está a ter.",    "sugestao": "Pode incluir mensagens de erro, comportamentos estranhos ou funcionalidades que não estejam a funcionar como esperado.",    "palavras_chave": [      "erro",      "problema",      "falha",      "funcionalidade",      "suporte",      "mensagem"    ]  }]